Rafa350/EOS/v2/Demo/TouchDemo/STM32F746/HardwareProfile_STM32F746G-DISC.h
#ifndef __HARDWARE_PROFILE_SMT32F746G_DISC_H
#define __HARDWARE_PROFILE_SMT32F746G_DISC_H


// Configuracio del sistema
//
#define CLOCK_SYSTEM_HZ            80000000
#define CLOCK_PERIPHERICAL_HZ      (CLOCK_SYSTEM_HZ / 1)


// -----------------------------------------------------------------------
// Indicadors lED
// -----------------------------------------------------------------------

#define LEDS_LD1_PORT        HAL_GPIO_PORT_G
#define LEDS_LD1_PIN         HAL_GPIO_PIN_13

#define LEDS_LD2_PORT        HAL_GPIO_PORT_G
#define LEDS_LD2_PIN         HAL_GPIO_PIN_14


// -----------------------------------------------------------------------
// Display grafic
// -----------------------------------------------------------------------

// Tipus de lletra disponibles
//
#define FONT_USE_Consolas8pt
#define FONT_USE_Consolas10pt
#define FONT_USE_Consolas12pt
#define FONT_USE_Consolas14pt
#define FONT_USE_Consolas18pt
#define FONT_USE_Consolas24pt

// Tipus de pantalla
//
#define DISPLAY_STM32F429I_DISC1

// Tipus de codificacio de color
//
#define DISPLAY_COLOR_565


// -----------------------------------------------------------------------
// Controlador del display RGBDirect
// -----------------------------------------------------------------------


// Punter a la memoria de video
//
#define RGBDIRECT_VRAM          ((uint32_t)0xD0000000)

// Format de color del controlador
//
#define RGBDIRECT_COLORMODE_565

// Control del pin HSYNC (Horizontal sync)
//
#define RGBDIRECT_HSYNC_PORT    HAL_GPIO_PORT_C
#define RGBDIRECT_HSYNC_PIN     HAL_GPIO_PIN_6
#define RGBDIRECT_HSYNC_AF      HAL_GPIO_AF14_LTDC

// Control del pin VSYNC (Vertical sync)
//
#define RGBDIRECT_VSYNC_PORT    HAL_GPIO_PORT_A
#define RGBDIRECT_VSYNC_PIN     HAL_GPIO_PIN_4
#define RGBDIRECT_VSYNC_AF      HAL_GPIO_AF14_LTDC

// Control del pin DE (Display enable)
//
#define RGBDIRECT_DE_PORT       HAL_GPIO_PORT_F
#define ILI9341LTDC_DE_PIN        HAL_GPIO_PIN_10
#define ILI9341LTDC_DE_AF         HAL_GPIO_AF14_LTDC

// Control del pin DOTCLK (Dot clock)
//
#define ILI9341LTDC_DOTCLK_PORT   HAL_GPIO_PORT_G
#define ILI9341LTDC_DOTCLK_PIN    HAL_GPIO_PIN_7
#define ILI9341LTDC_DOTCLK_AF     HAL_GPIO_AF14_LTDC

// Control del pin R2
//
#define ILI9341LTDC_R2_PORT       HAL_GPIO_PORT_C
#define ILI9341LTDC_R2_PIN        HAL_GPIO_PIN_10
#define ILI9341LTDC_R2_AF         HAL_GPIO_AF14_LTDC

// Control del pin R3
//
#define ILI9341LTDC_R3_PORT       HAL_GPIO_PORT_B
#define ILI9341LTDC_R3_PIN        HAL_GPIO_PIN_0
#define ILI9341LTDC_R3_AF         HAL_GPIO_AF9_LTDC

// Control del pin R4
//
#define ILI9341LTDC_R4_PORT       HAL_GPIO_PORT_A
#define ILI9341LTDC_R4_PIN        HAL_GPIO_PIN_11
#define ILI9341LTDC_R4_AF         HAL_GPIO_AF14_LTDC

// Control del pin R5
//
#define ILI9341LTDC_R5_PORT       HAL_GPIO_PORT_A
#define ILI9341LTDC_R5_PIN        HAL_GPIO_PIN_12
#define ILI9341LTDC_R5_AF         HAL_GPIO_AF14_LTDC

// Control del pin R6
//
#define ILI9341LTDC_R6_PORT       HAL_GPIO_PORT_B
#define ILI9341LTDC_R6_PIN        HAL_GPIO_PIN_1
#define ILI9341LTDC_R6_AF         HAL_GPIO_AF9_LTDC

// Control del pin R7
//
#define ILI9341LTDC_R7_PORT       HAL_GPIO_PORT_G
#define ILI9341LTDC_R7_PIN        HAL_GPIO_PIN_6
#define ILI9341LTDC_R7_AF         HAL_GPIO_AF14_LTDC

// Control del pin G2
//
#define ILI9341LTDC_G2_PORT       HAL_GPIO_PORT_A
#define ILI9341LTDC_G2_PIN        HAL_GPIO_PIN_6
#define ILI9341LTDC_G2_AF         HAL_GPIO_AF14_LTDC

// Control del pin G3
//
#define ILI9341LTDC_G3_PORT       HAL_GPIO_PORT_G
#define ILI9341LTDC_G3_PIN        HAL_GPIO_PIN_10
#define ILI9341LTDC_G3_AF         HAL_GPIO_AF9_LTDC

// Control del pin G4
//
#define ILI9341LTDC_G4_PORT       HAL_GPIO_PORT_B
#define ILI9341LTDC_G4_PIN        HAL_GPIO_PIN_10
#define ILI9341LTDC_G4_AF         HAL_GPIO_AF14_LTDC

// Control del pin G5
//
#define ILI9341LTDC_G5_PORT       HAL_GPIO_PORT_B
#define ILI9341LTDC_G5_PIN        HAL_GPIO_PIN_11
#define ILI9341LTDC_G5_AF         HAL_GPIO_AF14_LTDC

// Control del pin G6
//
#define ILI9341LTDC_G6_PORT       HAL_GPIO_PORT_C
#define ILI9341LTDC_G6_PIN        HAL_GPIO_PIN_7
#define ILI9341LTDC_G6_AF         HAL_GPIO_AF14_LTDC

// Control del pin G7
//
#define ILI9341LTDC_G7_PORT       HAL_GPIO_PORT_D
#define ILI9341LTDC_G7_PIN        HAL_GPIO_PIN_3
#define ILI9341LTDC_G7_AF         HAL_GPIO_AF14_LTDC

// Control del pin B2
//
#define ILI9341LTDC_B2_PORT       HAL_GPIO_PORT_D
#define ILI9341LTDC_B2_PIN        HAL_GPIO_PIN_6
#define ILI9341LTDC_B2_AF         HAL_GPIO_AF14_LTDC

// Control del pin B3
//
#define ILI9341LTDC_B3_PORT       HAL_GPIO_PORT_G
#define ILI9341LTDC_B3_PIN        HAL_GPIO_PIN_11
#define ILI9341LTDC_B3_AF         HAL_GPIO_AF14_LTDC

// Control del pin B4
//
#define ILI9341LTDC_B4_PORT       HAL_GPIO_PORT_G
#define ILI9341LTDC_B4_PIN        HAL_GPIO_PIN_12
#define ILI9341LTDC_B4_AF         HAL_GPIO_AF9_LTDC

// Control del pin B5
//
#define ILI9341LTDC_B5_PORT       HAL_GPIO_PORT_A
#define ILI9341LTDC_B5_PIN        HAL_GPIO_PIN_3
#define ILI9341LTDC_B5_AF         HAL_GPIO_AF14_LTDC

// Control del pin B6
//
#define ILI9341LTDC_B6_PORT       HAL_GPIO_PORT_B
#define ILI9341LTDC_B6_PIN        HAL_GPIO_PIN_8
#define ILI9341LTDC_B6_AF         HAL_GPIO_AF14_LTDC

// Control del pin B7
//
#define ILI9341LTDC_B7_PORT       HAL_GPIO_PORT_B
#define ILI9341LTDC_B7_PIN        HAL_GPIO_PIN_9
#define ILI9341LTDC_B7_AF         HAL_GPIO_AF14_LTDC

// Control del modul SPI
//
#define ILI9341LTDC_SPI_ID        HAL_SPI_ID_5


#endif
